In [1]:
import pandas as pd
import numpy as np

In [2]:
movie = pd.read_csv('data/movie_altered.csv')
movie.head()

,title,rating,year,duration,director_1,director_fb_likes_1,actor_1,actor_2,actor_3,actor_fb_likes_1,actor_fb_likes_2,actor_fb_likes_3
0,Avatar,PG-13,2009.0,178.0,James Cameron,0.0,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,Pirates of the Caribbean: At World's End,PG-13,2007.0,169.0,Gore Verbinski,563.0,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,Spectre,PG-13,2015.0,148.0,Sam Mendes,0.0,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,The Dark Knight Rises,PG-13,2012.0,164.0,Christopher Nolan,22000.0,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [3]:
movie.insert(0, 'id', np.arange(len(movie)))
movie.head()

,id,title,rating,year,duration,director_1,director_fb_likes_1,actor_1,actor_2,actor_3,actor_fb_likes_1,actor_fb_likes_2,actor_fb_likes_3
0,0,Avatar,PG-13,2009.0,178.0,James Cameron,0.0,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,1,Pirates of the Caribbean: At World's End,PG-13,2007.0,169.0,Gore Verbinski,563.0,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,2,Spectre,PG-13,2015.0,148.0,Sam Mendes,0.0,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,3,The Dark Knight Rises,PG-13,2012.0,164.0,Christopher Nolan,22000.0,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,4,Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [4]:
stubnames = ['director', 'director_fb_likes', 'actor', 'actor_fb_likes']
movie_long = pd.wide_to_long(movie, 
                                 stubnames=stubnames, 
                                 i='id', 
                                 j='num', 
                                 sep='_').reset_index()
movie_long['num'] = movie_long['num'].astype(int)
movie_long.head(9)

,id,num,duration,rating,title,year,director,director_fb_likes,actor,actor_fb_likes
0,0,1,178.0,PG-13,Avatar,2009.0,James Cameron,0.0,CCH Pounder,1000.0
1,0,2,178.0,PG-13,Avatar,2009.0,NaN,NaN,Joel David Moore,936.0
2,0,3,178.0,PG-13,Avatar,2009.0,NaN,NaN,Wes Studi,855.0
3,1,1,169.0,PG-13,Pirates of the Caribbean: At World's End,2007.0,Gore Verbinski,563.0,Johnny Depp,40000.0
4,1,2,169.0,PG-13,Pirates of the Caribbean: At World's End,2007.0,NaN,NaN,Orlando Bloom,5000.0
5,1,3,169.0,PG-13,Pirates of the Caribbean: At World's End,2007.0,NaN,NaN,Jack Davenport,1000.0
6,2,1,148.0,PG-13,Spectre,2015.0,Sam Mendes,0.0,Christoph Waltz,11000.0
7,2,2,148.0,PG-13,Spectre,2015.0,NaN,NaN,Rory Kinnear,393.0
8,2,3,148.0,PG-13,Spectre,2015.0,NaN,NaN,Stephanie Sigman,161.0

In [5]:
movie_table = movie_long[['id','title', 'year', 'duration', 'rating']]
director_table = movie_long[['id', 'director', 'num', 'director_fb_likes']]
actor_table = movie_long[['id', 'actor', 'num', 'actor_fb_likes']]

In [6]:
movie_table.head(9)

   id                                     title    year  duration rating
0   0                                    Avatar  2009.0     178.0  PG-13
1   0                                    Avatar  2009.0     178.0  PG-13
2   0                                    Avatar  2009.0     178.0  PG-13
3   1  Pirates of the Caribbean: At World's End  2007.0     169.0  PG-13
4   1  Pirates of the Caribbean: At World's End  2007.0     169.0  PG-13
5   1  Pirates of the Caribbean: At World's End  2007.0     169.0  PG-13
6   2                                   Spectre  2015.0     148.0  PG-13
7   2                                   Spectre  2015.0     148.0  PG-13
8   2                                   Spectre  2015.0     148.0  PG-13

In [7]:
director_table.head(9)

   id        director  num  director_fb_likes
0   0   James Cameron    1                0.0
1   0             NaN    2                NaN
2   0             NaN    3                NaN
3   1  Gore Verbinski    1              563.0
4   1             NaN    2                NaN
5   1             NaN    3                NaN
6   2      Sam Mendes    1                0.0
7   2             NaN    2                NaN
8   2             NaN    3                NaN

In [8]:
actor_table.head(9)

   id             actor  num  actor_fb_likes
0   0       CCH Pounder    1          1000.0
1   0  Joel David Moore    2           936.0
2   0         Wes Studi    3           855.0
3   1       Johnny Depp    1         40000.0
4   1     Orlando Bloom    2          5000.0
5   1    Jack Davenport    3          1000.0
6   2   Christoph Waltz    1         11000.0
7   2      Rory Kinnear    2           393.0
8   2  Stephanie Sigman    3           161.0

In [9]:
movie_table = movie_table.drop_duplicates().reset_index(drop=True)
director_table = director_table.dropna().reset_index(drop=True)
actor_table = actor_table.dropna().reset_index(drop=True)

In [10]:
movie_table.head

<bound method NDFrame.head of         id                                        title    year  duration  \
0        0                                       Avatar  2009.0     178.0
1        1     Pirates of the Caribbean: At World's End  2007.0     169.0
2        2                                      Spectre  2015.0     148.0
3        3                        The Dark Knight Rises  2012.0     164.0
4        4   Star Wars: Episode VII - The Force Awakens     NaN       NaN
5        5                                  John Carter  2012.0     132.0
6        6                                 Spider-Man 3  2007.0     156.0
7        7                                      Tangled  2010.0     100.0
8        8                      Avengers: Age of Ultron  2015.0     141.0
9        9       Harry Potter and the Half-Blood Prince  2009.0     153.0
10      10           Batman v Superman: Dawn of Justice  2016.0     183.0
11      11                             Superman Returns  2006.0     169.0
12      12                            Quantum of Solace  2008.0     106.0
13      13   Pirates of the Caribbean: Dead Man's Chest  2006.0     151.0
14      14                              The Lone Ranger  2013.0     150.0
15      15                                 Man of Steel  2013.0     143.0
16      16     The Chronicles of Narnia: Prince Caspian  2008.0     150.0
17      17                                 The Avengers  2012.0     173.0
18      18  Pirates of the Caribbean: On Stranger Tides  2011.0     136.0
19      19                               Men in Black 3  2012.0     106.0
20      20    The Hobbit: The Battle of the Five Armies  2014.0     164.0
21      21                       The Amazing Spider-Man  2012.0     153.0
22      22                                   Robin Hood  2010.0     156.0
23      23          The Hobbit: The Desolation of Smaug  2013.0     186.0
24      24                           The Golden Compass  2007.0     113.0
25      25                                    King Kong  2005.0     201.0
26      26                                      Titanic  1997.0     194.0
27      27                   Captain America: Civil War  2016.0     147.0
28      28                                   Battleship  2012.0     131.0
29      29                               Jurassic World  2015.0     124.0
...    ...                                          ...     ...       ...
4886  4886                                       Manito  2002.0      79.0
4887  4887                                      Rampage  2009.0      80.0
4888  4888                                      Slacker  1991.0     100.0
4889  4889                                  Dutch Kills  2015.0      90.0
4890  4890                                    Dry Spell  2013.0      90.0
4891  4891                                     Flywheel  2003.0     120.0
4892  4892                                       Exeter  2015.0      91.0
4893  4893                                   The Ridges  2011.0     143.0
4894  4894                              The Puffy Chair  2005.0      85.0
4895  4895                         Stories of Our Lives  2014.0      60.0
4896  4896                             Breaking Upwards  2009.0      88.0
4897  4897                     All Superheroes Must Die  2011.0      78.0
4898  4898                               Pink Flamingos  1972.0     108.0
4899  4899                                        Clean  2004.0     110.0
4900  4900                                   The Circle  2000.0      90.0
4901  4901                                  Tin Can Man  2007.0      83.0
4902  4902                                     The Cure  1997.0     111.0
4903  4903                               On the Downlow  2004.0      84.0
4904  4904                 Sanctuary; Quite a Conundrum  2012.0      82.0
4905  4905                                         Bang  1995.0      98.0
4906  4906                                       Primer  2004.0      77.0
4907  4907                                       Cavite  2005.0      80.0
4908  4908                                  El Mariachi  1992.0      81.0
4909  4909                              The Mongol King  2005.0      84.0
4910  4910                                    Newlyweds  2011.0      95.0
4911  4911                      Signed Sealed Delivered  2013.0      87.0
4912  4912                                The Following     NaN      43.0
4913  4913                         A Plague So Pleasant  2013.0      76.0
4914  4914                             Shanghai Calling  2012.0     100.0
4915  4915                            My Date with Drew  2004.0      90.0

         rating
0         PG-13
1         PG-13
2         PG-13
3         PG-13
4           NaN
5         PG-13
6         PG-13
7            PG
8         PG-13
9            PG
10        PG-13
11        PG-13
12        PG-13
13        PG-13
14        PG-13
15        PG-13
16           PG
17        PG-13
18        PG-13
19        PG-13
20        PG-13
21        PG-13
22        PG-13
23        PG-13
24        PG-13
25        PG-13
26        PG-13
27        PG-13
28        PG-13
29        PG-13
...         ...
4886        NaN
4887          R
4888          R
4889        NaN
4890        NaN
4891        NaN
4892          R
4893        NaN
4894          R
4895        NaN
4896        NaN
4897    Unrated
4898      NC-17
4899          R
4900  Not Rated
4901        NaN
4902        NaN
4903        NaN
4904        NaN
4905        NaN
4906      PG-13
4907  Not Rated
4908          R
4909      PG-13
4910  Not Rated
4911        NaN
4912      TV-14
4913        NaN
4914      PG-13
4915         PG

[4916 rows x 5 columns]>

In [11]:
director_table.head()

   id           director  num  director_fb_likes
0   0      James Cameron    1                0.0
1   1     Gore Verbinski    1              563.0
2   2         Sam Mendes    1                0.0
3   3  Christopher Nolan    1            22000.0
4   4        Doug Walker    1              131.0

In [12]:
movie.memory_usage(deep=True).sum()

2289770

In [13]:
movie_table.memory_usage(deep=True).sum() + \
director_table.memory_usage(deep=True).sum() + \
actor_table.memory_usage(deep=True).sum()

2538022

In [14]:
director_cat = pd.Categorical(director_table['director'])
director_table.insert(1, 'director_id', director_cat.codes)

actor_cat = pd.Categorical(actor_table['actor'])
actor_table.insert(1, 'actor_id', actor_cat.codes)

director_table.head()

   id  director_id           director  num  director_fb_likes
0   0          922      James Cameron    1                0.0
1   1          794     Gore Verbinski    1              563.0
2   2         2020         Sam Mendes    1                0.0
3   3          373  Christopher Nolan    1            22000.0
4   4          600        Doug Walker    1              131.0

In [15]:
actor_table.head()

   id  actor_id             actor  num  actor_fb_likes
0   0       824       CCH Pounder    1          1000.0
1   0      2867  Joel David Moore    2           936.0
2   0      6099         Wes Studi    3           855.0
3   1      2971       Johnny Depp    1         40000.0
4   1      4536     Orlando Bloom    2          5000.0

In [16]:
director_associative = director_table[['id', 'director_id', 'num']]
dcols = ['director_id', 'director', 'director_fb_likes']
director_unique = director_table[dcols].drop_duplicates().reset_index(drop=True)
director_associative.head()

   id  director_id  num
0   0          922    1
1   1          794    1
2   2         2020    1
3   3          373    1
4   4          600    1

In [17]:
director_unique.head()

   director_id           director  director_fb_likes
0          922      James Cameron                0.0
1          794     Gore Verbinski              563.0
2         2020         Sam Mendes                0.0
3          373  Christopher Nolan            22000.0
4          600        Doug Walker              131.0

In [18]:
actor_associative = actor_table[['id', 'actor_id', 'num']]
acols = ['actor_id', 'actor', 'actor_fb_likes']
actor_unique = actor_table[acols].drop_duplicates().reset_index(drop=True)
actor_associative.head()

   id  actor_id  num
0   0       824    1
1   0      2867    2
2   0      6099    3
3   1      2971    1
4   1      4536    2

In [19]:
actor_unique.head()

   actor_id             actor  actor_fb_likes
0       824       CCH Pounder          1000.0
1      2867  Joel David Moore           936.0
2      6099         Wes Studi           855.0
3      2971       Johnny Depp         40000.0
4      4536     Orlando Bloom          5000.0

In [20]:
movie_table.memory_usage(deep=True).sum() + \
director_associative.memory_usage(deep=True).sum() + \
director_unique.memory_usage(deep=True).sum() + \
actor_associative.memory_usage(deep=True).sum() + \
actor_unique.memory_usage(deep=True).sum()

1746526

In [21]:
movie_table.head()

   id                                       title    year  duration rating
0   0                                      Avatar  2009.0     178.0  PG-13
1   1    Pirates of the Caribbean: At World's End  2007.0     169.0  PG-13
2   2                                     Spectre  2015.0     148.0  PG-13
3   3                       The Dark Knight Rises  2012.0     164.0  PG-13
4   4  Star Wars: Episode VII - The Force Awakens     NaN       NaN    NaN

In [22]:
actors = actor_associative.merge(actor_unique, on='actor_id') \
                          .drop('actor_id', 1) \
                          .pivot_table(index='id', columns='num', aggfunc='first')

actors.columns = actors.columns.get_level_values(0) + '_' + \
                 actors.columns.get_level_values(1).astype(str)

directors = director_associative.merge(director_unique, on='director_id') \
                          .drop('director_id', 1) \
                          .pivot_table(index='id', columns='num', aggfunc='first')

directors.columns = directors.columns.get_level_values(0) + '_' + \
                    directors.columns.get_level_values(1).astype(str)

In [23]:
actors.head()

,actor_1,actor_2,actor_3,actor_fb_likes_1,actor_fb_likes_2,actor_fb_likes_3
id,,,,,,
0,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [24]:
directors.head()

           director_1  director_fb_likes_1
id
0       James Cameron                  0.0
1      Gore Verbinski                563.0
2          Sam Mendes                  0.0
3   Christopher Nolan              22000.0
4         Doug Walker                131.0

In [28]:
movie2 = movie_table.merge(directors.reset_index(), on='id', how='left') \
                    .merge(actors.reset_index(), on='id', how='left')

In [29]:
movie2.head()

,id,title,year,duration,rating,director_1,director_fb_likes_1,actor_1,actor_2,actor_3,actor_fb_likes_1,actor_fb_likes_2,actor_fb_likes_3
0,0,Avatar,2009.0,178.0,PG-13,James Cameron,0.0,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,1,Pirates of the Caribbean: At World's End,2007.0,169.0,PG-13,Gore Verbinski,563.0,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,2,Spectre,2015.0,148.0,PG-13,Sam Mendes,0.0,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,3,The Dark Knight Rises,2012.0,164.0,PG-13,Christopher Nolan,22000.0,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,4,Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,Doug Walker,131.0,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [30]:
movie.equals(movie2[movie.columns])

False